; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; DOMAIN: warehouse (Fully Documented Standard Version)
;;
;; Purpose:
;; This domain models a warehouse picking system where:
;;   - Workers execute commands (orders)
;;   - Products must be picked by type and location
;;   - Zone-based scanning controls workflow progression
;;   - Each order must pass per-type checkpoints before completion
;;
;; Workflow:
;;   Start Mission → Print Label → Move → Scan Zone →
;;   Pick Items → Verify Checkpoints → Finalize Order
;;
;; Key Concepts:
;;   - Commands represent customer orders
;;   - Products are assigned and picked per order
;;   - Each product type requires zone validation
;;   - Workers must not move with open picking zones
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)

    (:requirements
        :strips
        :typing
        :negative-preconditions
        :universal-preconditions
        :quantified-preconditions
        :disjunctive-preconditions
    )

    (:types
        product
        product-type
        command
        worker
        location
    )

    (:predicates

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; WORKER LOCATION AND STATE
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (at ?w - worker ?l - location)                 ;; Worker position in warehouse
        (free ?w - worker)                             ;; Worker is not assigned to a command
        (working-on ?w - worker ?c - command)          ;; Worker is actively executing a command

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; COMMAND STATE
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (mission-started ?c - command)                 ;; Command has been activated
        (command-complete ?c - command)                ;; Command fully completed

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; INVENTORY AND ASSIGNMENT
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (in-inventory ?p - product)                    ;; Product is still available in stock
        (assigned ?p - product ?c - command)           ;; Product assigned to a command

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; LOCATION STRUCTURE
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (start-loc ?l - location)                      ;; Starting/control location for workers
        (type-zone ?t - product-type ?l - location)    ;; Location corresponds to product-type zone

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; PRODUCT INFORMATION
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (is-type ?p - product ?t - product-type)       ;; Product belongs to a type
        (at-loc ?p - product ?l - location)            ;; Product is physically at a location

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; COMMAND REQUIREMENTS
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (requires-type ?c - command ?t - product-type) ;; Order requires product type
        (required-product ?c - command ?p - product)    ;; Specific product required by command

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; ZONE CONTROL / WORKFLOW TRACKING
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (zone-open ?w - worker ?c - command ?t - product-type)
                                                      ;; Worker has an active picking session for a type

        (checkpoint-verified ?t - product-type ?c - command)
                                                      ;; All required checks completed for a type

        (order-label-printed ?c - command)             ;; Order label has been printed
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: New-mission-PDA-and-print-order-label
    ;;
    ;; Purpose:
    ;;     Initialize a command and assign it to a worker.
    ;;
    ;; Preconditions:
    ;;     - Worker must be free
    ;;     - Worker must be at a start location
    ;;     - Command must not already be started
    ;;
    ;; Effects:
    ;;     - Worker becomes assigned to command
    ;;     - Command is marked as started
    ;;     - Worker is no longer free
    ;;
    ;; Workflow Stage:
    ;;     Mission initialization / dispatch
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action New-mission-PDA-and-print-order-label

        :parameters (?w - worker ?c - command ?l - location)

        :precondition
        (and
            (free ?w)
            (at ?w ?l)
            (start-loc ?l)
            (not (mission-started ?c))
        )

        :effect
        (and
            (not (free ?w))
            (working-on ?w ?c)
            (mission-started ?c)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: Print-order-label
    ;;
    ;; Purpose:
    ;;     Generate and attach order label for tracking.
    ;;
    ;; Preconditions:
    ;;     - Worker is assigned to command
    ;;     - Label has not yet been printed
    ;;
    ;; Effects:
    ;;     - Order label becomes available
    ;;
    ;; Workflow Stage:
    ;;     Order preparation / identification
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action Print-order-label

        :parameters (?w - worker ?c - command)

        :precondition
        (and
            (working-on ?w ?c)
            (not (order-label-printed ?c))
        )

        :effect
        (order-label-printed ?c)
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: move
    ;;
    ;; Purpose:
    ;;     Move worker between locations while ensuring safe workflow.
    ;;
    ;; Preconditions:
    ;;     - Worker is assigned to a command
    ;;     - Worker is at origin location
    ;;     - No active zone sessions exist
    ;;
    ;; Effects:
    ;;     - Worker changes location
    ;;
    ;; Constraint:
    ;;     - Worker cannot leave a zone while a picking session is open
    ;;
    ;; Workflow Stage:
    ;;     Navigation / warehouse traversal
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action move

        :parameters (?w - worker ?c - command ?from - location ?to - location)

        :precondition
        (and
            (working-on ?w ?c)
            (at ?w ?from)

            ;; ensure no open zone sessions
            (forall (?t - product-type)
                (not (zone-open ?w ?c ?t))
            )
        )

        :effect
        (and
            (not (at ?w ?from))
            (at ?w ?to)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: Scan-item-type
    ;;
    ;; Purpose:
    ;;     Open a picking session for a product type in a zone.
    ;;
    ;; Preconditions:
    ;;     - Worker is in correct zone location
    ;;     - Location corresponds to product type zone
    ;;     - No existing open session for this type
    ;;
    ;; Effects:
    ;;     - Zone session becomes active
    ;;
    ;; Workflow Stage:
    ;;     Zone validation / picking setup
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action Scan-item-type

        :parameters (?w - worker ?c - command ?t - product-type ?l - location)

        :precondition
        (and
            (working-on ?w ?c)
            (at ?w ?l)
            (type-zone ?t ?l)
            (not (zone-open ?w ?c ?t))
        )

        :effect
        (zone-open ?w ?c ?t)
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: add-to-order
    ;;
    ;; Purpose:
    ;;     Pick a product and assign it to a command.
    ;;
    ;; Preconditions:
    ;;     - Worker is in active picking session
    ;;     - Product is at worker location
    ;;     - Product matches required type
    ;;     - Product is still in inventory
    ;;
    ;; Effects:
    ;;     - Product is removed from inventory
    ;;     - Product is assigned to command
    ;;
    ;; Workflow Stage:
    ;;     Picking / order fulfillment
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action add-to-order

        :parameters (?w - worker ?c - command ?p - product ?t - product-type ?l - location)

        :precondition
        (and
            (working-on ?w ?c)
            (at ?w ?l)
            (at-loc ?p ?l)
            (is-type ?p ?t)
            (zone-open ?w ?c ?t)
            (in-inventory ?p)
        )

        :effect
        (and
            (not (in-inventory ?p))
            (assigned ?p ?c)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: Scan-order-label
    ;;
    ;; Purpose:
    ;;     Verify completion of all required products in a zone.
    ;;
    ;; Preconditions:
    ;;     - Worker is in correct zone
    ;;     - Zone session is active
    ;;     - All required products are assigned
    ;;
    ;; Effects:
    ;;     - Zone is marked as completed
    ;;     - Picking session is closed
    ;;
    ;; Workflow Stage:
    ;;     Checkpoint validation
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action Scan-order-label

        :parameters (?w - worker ?c - command ?t - product-type ?l - location)

        :precondition
        (and
            (working-on ?w ?c)
            (at ?w ?l)
            (type-zone ?t ?l)
            (zone-open ?w ?c ?t)

            ;; ensure all required products are assigned
            (forall (?p - product)
                (imply
                    (required-product ?c ?p)
                    (assigned ?p ?c)
                )
            )
        )

        :effect
        (and
            (not (zone-open ?w ?c ?t))
            (checkpoint-verified ?t ?c)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: finish-command-print-label-scan-finished-codebar-and-leave-in-controlzone
    ;;
    ;; Purpose:
    ;;     Finalize a command after all zones are validated.
    ;;
    ;; Preconditions:
    ;;     - Worker is assigned to command
    ;;     - All required product-type checkpoints are verified
    ;;     - No zone sessions are open
    ;;
    ;; Effects:
    ;;     - Worker becomes free
    ;;     - Command is completed
    ;;
    ;; Workflow Stage:
    ;;     Order completion / checkout
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action finish-command-print-label-scan-finished-codebar-and-leave-in-controlzone

        :parameters (?w - worker ?c - command)

        :precondition
        (and
            (working-on ?w ?c)

            ;; all required types checked
            (forall (?t - product-type)
                (imply
                    (requires-type ?c ?t)
                    (checkpoint-verified ?t ?c)
                )
            )

            ;; no active picking sessions
            (forall (?t - product-type)
                (not (zone-open ?w ?c ?t))
            )
        )

        :effect
        (and
            (free ?w)
            (not (working-on ?w ?c))
            (command-complete ?c)
        )
    )

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PROBLEM: warehouse-two-workers-assigned
;;
;; Purpose:
;;   Minimal warehouse scenario used to test:
;;     - Two workers executing parallel commands
;;     - Explicit product-to-command assignment enforcement
;;     - Zone-based picking constraints (typeA / typeB)
;;
;; Key Idea:
;;   This is a reduced test case designed to verify that:
;;     - Planning requires explicit assignments
;;     - Commands are split across workers logically
;;     - System respects product-type constraints
;;
;; Structure:
;;   - Worker initialization
;;   - Warehouse layout (zones + locations)
;;   - Product inventory setup
;;   - Command requirements
;;   - Explicit assignment goal constraints
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem warehouse-two-workers-assigned)

(:domain warehouse)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; OBJECTS
;;
;; Purpose:
;;   Defines the minimal set of entities needed to execute the scenario:
;;     - Workers performing tasks
;;     - Commands representing orders
;;     - Product types defining classification rules
;;     - Locations representing warehouse zones
;;     - Products (small controlled dataset for testing)
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:objects

    ;; ==========================
    ;; WORKERS
    ;; ==========================

    worker1 worker2 - worker

    ;; ==========================
    ;; COMMANDS
    ;; ==========================

    cmd1 cmd2 - command

    ;; ==========================
    ;; PRODUCT TYPES
    ;; ==========================

    typeA typeB - product-type

    ;; ==========================
    ;; LOCATIONS
    ;; ==========================

    locStart locA locB - location

    ;; ==========================
    ;; PRODUCTS
    ;; ==========================

    a1 a2 a3 a4 - product
    b1 b2 b3 b4 - product

)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; INITIAL STATE
;;
;; Purpose:
;;   Defines the starting warehouse configuration:
;;     - Worker positions and availability
;;     - Zone mapping for product types
;;     - Product classification and placement
;;     - Inventory availability
;;     - Command requirements
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:init

    ;; ==========================
    ;; WORKER STATE
    ;; ==========================

    (free worker1)
    (free worker2)

    (at worker1 locStart)
    (at worker2 locStart)

    ;; ==========================
    ;; START LOCATION
    ;; ==========================

    (start-loc locStart)

    ;; ==========================
    ;; ZONE CONFIGURATION
    ;; ==========================

    (type-zone typeA locA)
    (type-zone typeB locB)

    ;; ==========================
    ;; PRODUCT CLASSIFICATION
    ;; ==========================

    (is-type a1 typeA)
    (is-type a2 typeA)
    (is-type a3 typeA)
    (is-type a4 typeA)

    (is-type b1 typeB)
    (is-type b2 typeB)
    (is-type b3 typeB)
    (is-type b4 typeB)

    ;; ==========================
    ;; PRODUCT LOCATIONS
    ;; ==========================

    (at-loc a1 locA)
    (at-loc a2 locA)
    (at-loc a3 locA)
    (at-loc a4 locA)

    (at-loc b1 locB)
    (at-loc b2 locB)
    (at-loc b3 locB)
    (at-loc b4 locB)

    ;; ==========================
    ;; INVENTORY STATE
    ;; ==========================

    (in-inventory a1)
    (in-inventory a2)
    (in-inventory a3)
    (in-inventory a4)

    (in-inventory b1)
    (in-inventory b2)
    (in-inventory b3)
    (in-inventory b4)

    ;; ==========================
    ;; COMMAND REQUIREMENTS
    ;; ==========================

    (requires-type cmd1 typeA)
    (requires-type cmd1 typeB)

    (requires-type cmd2 typeA)
    (requires-type cmd2 typeB)

    ;; ==========================================================
    ;; CRITICAL SECTION: EXPLICIT PRODUCT ASSIGNMENT
    ;;
    ;; Purpose:
    ;;   This section enforces deterministic goal structure by:
    ;;     - Forcing exact product-to-command mapping
    ;;     - Preventing ambiguous or partial solutions
    ;;     - Ensuring planner must assign specific products
    ;;
    ;; Effect:
    ;;   - cmd1 must receive a1, a2, b1, b2
    ;;   - cmd2 must receive a3, a4, b3, b4
    ;;
    ;; This makes the problem:
    ;;   - Fully constrained
    ;;   - Easy to validate
    ;;   - Suitable for testing planner correctness
    ;;
    ;; ==========================================================

)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; GOAL STATE
;;
;; Purpose:
;;   Defines success conditions:
;;     - Both commands must be completed
;;     - All required assignments must be satisfied
;;     - Ensures no shortcut solutions are possible
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:goal
    (and

        ;; ==========================
        ;; COMPLETION CONDITIONS
        ;; ==========================

        (command-complete cmd1)
        (command-complete cmd2)

        ;; ==========================
        ;; CMD1 ASSIGNMENTS
        ;; ==========================

        (assigned a1 cmd1)
        (assigned a2 cmd1)

        (assigned b1 cmd1)
        (assigned b2 cmd1)

        ;; ==========================
        ;; CMD2 ASSIGNMENTS
        ;; ==========================

        (assigned a3 cmd2)
        (assigned a4 cmd2)

        (assigned b3 cmd2)
        (assigned b4 cmd2)

    )
)

)

; plan
1. (new-mission-pda-and-print-order-label worker1 cmd1 locstart)
   deleted: (free worker1)
   added: (working-on worker1 cmd1) (mission-started cmd1)
   goals met: 0 of 10
2. (new-mission-pda-and-print-order-label worker2 cmd2 locstart)
   deleted: (free worker2)
   added: (working-on worker2 cmd2) (mission-started cmd2)
   goals met: 0 of 10
3. (move worker1 cmd1 locstart locb)
   deleted: (at worker1 locstart)
   added: (at worker1 locb)
   goals met: 0 of 10
4. (move worker2 cmd2 locstart locb)
   deleted: (at worker2 locstart)
   added: (at worker2 locb)
   goals met: 0 of 10
5. (scan-item-type worker1 cmd1 typeb locb)
   added: (zone-open worker1 cmd1 typeb)
   goals met: 0 of 10
6. (scan-item-type worker2 cmd2 typeb locb)
   added: (zone-open worker2 cmd2 typeb)
   goals met: 0 of 10
7. (add-to-order worker1 cmd1 b1 typeb locb)
   deleted: (in-inventory b1)
   added: (assigned b1 cmd1)
   goals met: 1 of 10
8. (add-to-order worker1 cmd1 b2 typeb locb)
   deleted: (in-inventory b2)
   added: (assigned b2 cmd1)
   goals met: 2 of 10
9. (add-to-order worker2 cmd2 b3 typeb locb)
   deleted: (in-inventory b3)
   added: (assigned b3 cmd2)
   goals met: 3 of 10
10. (add-to-order worker2 cmd2 b4 typeb locb)
   deleted: (in-inventory b4)
   added: (assigned b4 cmd2)
   goals met: 4 of 10
11. (scan-order-label worker1 cmd1 typeb locb)
   deleted: (zone-open worker1 cmd1 typeb)
   added: (checkpoint-verified typeb cmd1)
   goals met: 4 of 10
12. (scan-order-label worker2 cmd2 typeb locb)
   deleted: (zone-open worker2 cmd2 typeb)
   added: (checkpoint-verified typeb cmd2)
   goals met: 4 of 10
13. (move worker1 cmd1 locb loca)
   deleted: (at worker1 locb)
   added: (at worker1 loca)
   goals met: 4 of 10
14. (move worker2 cmd2 locb loca)
   deleted: (at worker2 locb)
   added: (at worker2 loca)
   goals met: 4 of 10
15. (scan-item-type worker1 cmd1 typea loca)
   added: (zone-open worker1 cmd1 typea)
   goals met: 4 of 10
16. (scan-item-type worker2 cmd2 typea loca)
   added: (zone-open worker2 cmd2 typea)
   goals met: 4 of 10
17. (add-to-order worker1 cmd1 a1 typea loca)
   deleted: (in-inventory a1)
   added: (assigned a1 cmd1)
   goals met: 5 of 10
18. (add-to-order worker1 cmd1 a2 typea loca)
   deleted: (in-inventory a2)
   added: (assigned a2 cmd1)
   goals met: 6 of 10
19. (add-to-order worker2 cmd2 a3 typea loca)
   deleted: (in-inventory a3)
   added: (assigned a3 cmd2)
   goals met: 7 of 10
20. (add-to-order worker2 cmd2 a4 typea loca)
   deleted: (in-inventory a4)
   added: (assigned a4 cmd2)
   goals met: 8 of 10
21. (scan-order-label worker1 cmd1 typea loca)
   deleted: (zone-open worker1 cmd1 typea)
   added: (checkpoint-verified typea cmd1)
   goals met: 8 of 10
22. (scan-order-label worker2 cmd2 typea loca)
   deleted: (zone-open worker2 cmd2 typea)
   added: (checkpoint-verified typea cmd2)
   goals met: 8 of 10
23. (finish-command-print-label-scan-finished-codebar-and-leave-in-controlzone worker1 cmd1)
   deleted: (working-on worker1 cmd1)
   added: (free worker1) (command-complete cmd1)
   goals met: 9 of 10
24. (finish-command-print-label-scan-finished-codebar-and-leave-in-controlzone worker2 cmd2)
   deleted: (working-on worker2 cmd2)
   added: (free worker2) (command-complete cmd2)
   goals met: 10 of 10
